
#ifndef __SERVER_USART_H__
#define __SERVER_USART_H__

#include "config.h"
#include "ember-types.h"
#include "frame.h"

////////////////////////////////////////////////////////////////////////
//constants and globals

/////////////////////////////////////////////////////////////////////////////////////////////
//
//* 函数名      : EmberStatus sea_senduniserver ( u8 id, u16 road, u8 len, void * msg )
//* 功能        : send lamp message to server
//* 输入参数    : u8 id, u16 road, u8 len, void * msg
//* 输出参数    : status of send message
//* 修改记录    : 无
//* 备注        : 无
//*------------------------------------------------*/
EmberStatus sea_senduniserver ( u8 id, u16 road, u8 len, void * msg );

/////////////////////////////////////////////////////////////////////////////////////////////
//  new!
//* 函数名      : void sea_parseframe ( pframe_t ptr )
//* 功能        : 处理上位机通过串口发的信息
//* 输入参数    : pframe_t ptr
//* 输出参数    : 无
//* 修改记录    : 无
//* 备注        : 无
//*------------------------------------------------*/
void sea_parseframe ( pframe_t ptr );

////////////////////////////////////////////////////////////////////////
// public functions

/////////////////////////////////////////////////////////////////////////////////////////////
//
//* 函数名      : void sea_SendKeyRptViaUsart(void)
//* 功能        : 单机版，通过串口报告Key Rpt
//* 输入参数    : 无
//* 输出参数    : 无
//* 修改记录    : 无
//* 备注        : 无
//*------------------------------------------------*/
void sea_SendKeyRptViaUsart(void);

/////////////////////////////////////////////////////////////////////////////////////////////
//
//* 函数名      : void sea_SendFulRptViaUsart(void)
//* 功能        : 单机版，通过串口报告Ful Rpt
//* 输入参数    : 无
//* 输出参数    : 无
//* 修改记录    : 无
//* 备注        : 无
//*------------------------------------------------*/
void sea_SendFulRptViaUsart(void);

/////////////////////////////////////////////////////////////////////////////////////////////
//
//* 函数名      : void sea_SendDateViaUsart(void)
//* 功能        : 单机版，通过串口 向Server报告时间
//* 输入参数    : 无
//* 输出参数    : 无
//* 修改记录    : 无
//* 备注        : 无
//*------------------------------------------------*/
void sea_SendDateViaUsart(void);

/////////////////////////////////////////////////////////////////////////////////////////////
//
//* 函数名      : void sea_SendDateReqViaUsart(void)
//* 功能        : 请求与服务器时间同步
//* 输入参数    : 无
//* 输出参数    : 无
//* 修改记录    : 无
//* 备注        : 无
//*------------------------------------------------*/
void sea_SendDateReqViaUsart(void);

/////////////////////////////////////////////////////////////////////////////////////////////
//
//* 函数名      : void sea_SendAckViaUsart(int8u)
//* 功能        : 单机版，通过串口 向Server返回命令执行情况，网页提示发送成功或者请求重发
//* 输入参数    : 无
//* 输出参数    : 无
//* 修改记录    : 无
//* 备注        : 无
//*------------------------------------------------*/
void sea_SendAckViaUsart(int8u);

////////////////////////////////////////////////////////////////////////
#endif // __SERVER_USART_H__