#ifndef __SEASPI_H__
#define __SEASPI_H__

#include "config.h"
#include "ember.h"
#include "hal.h"

#define SPITIMEOUT    (0x80000)
#define SPIEMPTY      (0xff)

/////////////////////////////////////////////////////////////////////////////////////////////
//
//* 函数名      : SPI_Configuration
//* 功能        : SPI初始化
//* 输入参数    : 无
//* 输出参数    : 无
//* 修改记录    : 无
//* 备注        : 无
//*------------------------------------------------*/
void SPI_Configuration ( void );

/////////////////////////////////////////////////////////////////////////////////////////////
//
//* 函数名      : void spi_start( void )
//* 功能        : 开始SPI传输，SSEL引脚置低
//* 输入参数    : 无
//* 输出参数    : 无
//* 修改记录    : 无
//* 备注        : 无
//*------------------------------------------------*/
void spi_start ( void );

/////////////////////////////////////////////////////////////////////////////////////////////
//
//* 函数名      : void spi_end( void )
//* 功能        : 结束SPI传输，SSEL引脚置高
//* 输入参数    : 无
//* 输出参数    : 无
//* 修改记录    : 无
//* 备注        : 无
//*------------------------------------------------*/
void spi_end ( void );

/////////////////////////////////////////////////////////////////////////////////////////////
//
//* 函数名      : u8 spi_writebyte ( u16 data )
//* 功能        : Write a byte over the SPI
//* 输入参数    : 无
//* 输出参数    : 无
//* 修改记录    : 无
//* 备注        : 无
//*------------------------------------------------*/
u8 spi_writebyte ( u8 data );

/////////////////////////////////////////////////////////////////////////////////////////////
//
//* 函数名      : u16 spi_readbyte ( void )
//* 功能        : Read a byte over the SPI
//* 输入参数    : 无
//* 输出参数    : 无
//* 修改记录    : 无
//* 备注        : 无
//*------------------------------------------------*/
u8 spi_readbyte ( void );

/////////////////////////////////////////////////////////////////////////////////////////////
//
//* 函数名      : u16 spi_readwrite ( u16 write_data )
//* 功能        : Read and write a byte over the SPI
//* 输入参数    : 无
//* 输出参数    : 无
//* 修改记录    : 无
//* 备注        : 无
//*------------------------------------------------*/
u8 spi_readwrite ( u8 write_data );

/////////////////////////////////////////////////////////////////////////////////////////////
//
//* 函数名      : bool spi_isnotempty ( void )
//* 功能        : 
//* 输入参数    : 无
//* 输出参数    : 无
//* 修改记录    : 无
//* 备注        : 无
//*------------------------------------------------*/
bool spi_isnotempty ( void );

/////////////////////////////////////////////////////////////////////////////////////////////
//
//* 函数名      : bool spi_iselect ( void )
//* 功能        : 
//* 输入参数    : 无
//* 输出参数    : 无
//* 修改记录    : 无
//* 备注        : 无
//*------------------------------------------------*/
bool spi_iselect ( void );

/////////////////////////////////////////////////////////////////////////////////////////////
#endif   // __SEASPI_H__