#ifndef __COMMAND_H__
#define __COMMAND_H__

//////////////////////////////////////////////////////////////////////////////
//
#include "config.h"
#include "stm32f10x_type.h"
#include "frame.h"

/////////////////////////////////////////////////////////////////////////////////////////////
//* 函数名      : void sea_parseroadframe ( pframe_t ptr )
//* 功能        : 处理上位机通过串口发的信息
//* 输入参数    : pframe_t ptr
//* 输出参数    : 无
//* 修改记录    : 无
//* 备注        : 无
//*------------------------------------------------*/
void sea_parseroadframe ( pframe_t ptr );

/////////////////////////////////////////////////////////////////////////////////////////////
//* 函数名      : void sea_parselampframe ( pframe_t ptr )
//* 功能        : 处理上位机通过串口发的信息
//* 输入参数    : pframe_t ptr
//* 输出参数    : 无
//* 修改记录    : 无
//* 备注        : 无
//*------------------------------------------------*/
void sea_parselampframe ( pframe_t ptr );

/////////////////////////////////////////////////////////////////////////////////////////////
//* 函数名      : void sea_lampconfig  ( int argc, char * argv[] )
//* 功能        : lamp command interface
//* 输入参数    : int argc, char * argv[]
//* 输出参数    : 无
//* 修改记录    : 无
//* 备注        : 无
//*------------------------------------------------*/
void sea_lampconfig  ( int argc, char * argv[] );

/////////////////////////////////////////////////////////////////////////////////////////////
//* 函数名      : void sea_roadconfig  ( int argc, char * argv[] )
//* 功能        : road command interface
//* 输入参数    : int argc, char * argv[]
//* 输出参数    : 无
//* 修改记录    : 无
//* 备注        : 无
//*------------------------------------------------*/
void sea_roadconfig  ( int argc, char * argv[] );

/////////////////////////////////////////////////////////////////////////////////////////////
//* 函数名      : void sea_roadkeyboardinput ( char ch )
//* 功能        : road command input from keyboard or uart
//* 输入参数    : char ch
//* 输出参数    : 无
//* 修改记录    : 无
//* 备注        : 无
//*------------------------------------------------*/
void sea_roadkeyboardinput ( char ch );

/////////////////////////////////////////////////////////////////////////////////////////////
//* 函数名      : void sea_lampkeyboardinput ( char ch )
//* 功能        : lamp command input from keyboard or uart
//* 输入参数    : char ch
//* 输出参数    : 无
//* 修改记录    : 无
//* 备注        : 无
//*------------------------------------------------*/
void sea_lampkeyboardinput ( char ch );

//////////////////////////////////////////////////////////////////////////////
//
extern frame_info_t uartfrm;

//////////////////////////////////////////////////////////////////////////////
//
#endif  // __COMMAND_H__